<!DOCTYPE html>
<html>
    <head>
        <title>HTML</title>
        <link rel="stylesheet" type="text/css" href="tstyle.css">
         <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE-edge">
    </head>

    <body>
    <div class="main">
        <div class="header">
            <div class="hdax">
                 <img src="tumo.png" alt="Mountain View" width="400" height="200"  class="imgt">
            </div>
            <div class="haj">
                Phone 1 <br>Phone2
            </div>
           
        </div>

          <div class="menu">
               <?php include 'menu.php'; ?>
        </div>
        <div class="content">
           
            
            <p class="htp"><img src="html.png" width="160" height="200" class="imht"> <p class="htmt">HTML (անգլ.՝ HyperText Markup Language, գերտեքստի նշագրման լեզու), նշագրման լեզու, որն օգտագործվում է վեբ-էջերի մեծամասնության նշագրման համար։ HTML լեզուն վերամշակվում է դիտարկչի կողմից և ցուցադրվում է մարդու կողմից հեշտ ընթեռնելի փաստաթղթի տեսքով։ HTML-ի օգնությամբ հեշտությամբ կարելի է ստեղծել համեմատաբար պարզ, սակայն գեղեցիկ ձևավորված փասթաթուղթ։ Ի հավելումն փասթաթղթի կառուցվածքի պարզեցմանը, HTML-ում աջակցվում էր հիպերտեքստը։ Մուլտիմեդիայի հնարավորությունները ավելացվեցին քիչ ավելի ուշ։ Ի սկզբանե HTML լեզուն ստեղծվել է որպես փասթաթղթերի կառուցման և ձևավորման միջոց՝ անկախ օգտագործվող արտածման միջոցից (էկրան, տպիչ և այլն) ցուցադրելու միջոց։ Նախնական HTML ձևաչափով տեքստը պետք է առանց ոճային և կառուծվածքային ձևափոխման արտածվեր սարքավորման վրա՝ տարբեր տեխնիկական համալրմամբ (ժամանակակից համակարգչի գունավոր էկրանը, օրգանայզերի մոնոխրոմային էկրան, բջջային հեռախոսների կամ տեքստերի ձայնային վերարտադրման ծրագրերի կամ սարքավորումների սահմանափակ չափերով էկրան)։ Սակայն HTML-ի ժամանակակից կիրառումը հեռու է սկզբնական նշանակությունից։ Տեքստային փաստաթղթերը, որոնք պարունակում են HTML կոդ (այդ փաստաթղթերը հիմնականում ունեն .html կամ .htm ընդլայնում), մշակվում են հատուկ ծրագրերի միջոցով, որոնք ցուցադրում են փաստաթուղթը իր ձևավորման համաձայն։ Այդ ծրագրերը, որոնք անվանում են դիտարկիչներ (անգլ.՝ browser), սովորաբար իրենցից ներկայացնում են հարմար միջավայր վեբ էջերի հայցման, դրանց դիտման և անհրաժեշտության դեպքում նաև դեպի սերվեր տվյալների փոխանցման համար։ Այժմ աշխարհում առավել գործածվող դիտարկիչներն են՝ Մոզիլա Ֆայրֆոքս, Գուգլ Քրոմ, Ինտերնետ Էքսպլորեր, Օպերա և Սաֆարի։

1990-ական թվականի կեսերին առաջ եկավ հետևյալ երևույթը. դիտարկիչների հիմնական արտադրող ընկերությունները՝ Նեթսքեյփ (անգլ.՝ Netscape) և Մայքրոսոֆթ ((անգլ.)Microsoft), սկսեցին ներառել HTML-ը տարրերի սեպական հավաքածուներով։ Տարբեր դիտարկիչների անհամատեղելիության պատճառով ստեղվեց խառնաշփոթ, առավելապես բարդություններ էին առաջանում նույն փասթաթուղթը տարբեր դիտարկիչներում նույն տեսքով ստանալու հարցում։ Վեբ մասնագետները ստիպված էին միևնույն էջը մի քանի տարբերակով ստեղծել։ 2000-ականների սկզբին, մի քանի տարով այդ խնդիրը փոքր ինչ կորցրեց իր հրատապությունը՝ կապված Ինտերնետ Էքսպլորերի տարածման և զարգացնամ հետ։ HTML լեզվով գրված ցանկացած փաստաթուղթ իրենից ներկայացնում է իրար մեջ ներդրված տարրերի հավաքածու (անգլ.՝ HTML element), ընդ որում բոլոր տարրերի սկիզբը և վերջը նշվում է հատուկ նշիչներով՝ պիտակներով (անգլ.՝ tag)։ Տարրերը կարող են լինել դատարկ, այսինքն՝ չպարունակեն ոչ մի տեքստ կամ տվյալ, օրինակ. <br /> պիտակը, որը ջարդում է տողը, հաջորդող տեքստը սկսելով նոր տողից (բայց ոչ նոր պարբերությունից)։ Այս դեպքում սովորաբար չի նշվում փակող պիտակ։ Բացի այդ, տարրերը կարող են պարունակել հատկանիշներ (անգլ.՝ HTML ատրիբուտներ), որոնք որոշում են նրանց որոշակի հատկանիշներ, օրնակ. տառաչափը font տարրի համար։ Ատրիբուտները նշվում են բացող պիտակի մեջ։ HTML փաստաթուղթն սկսվում է <html> թէգով և ավարտվում է </html> թէգով: Փաստաթուղթը բաղկացած է երկու հիմնական մասերից` ծանուցման բաժին և փաստաթղթի մարմին: Ծանուցման բաժինը ներառվում է <head></head> թէգերի մեջ: Այս բաժնում ներառվում են նաև տեխնիկական այլ բնութագրեր:Էջի վերնագիրը տրվում է <title> ..</title> մեկնարկի և ավարտի թէգերի միջև: Html-փաստաթղթի մարմինը ներառվում է<body> և </body> զույգ թէգերի մեջ: Գրանցումները, որտեղ նշվել են տարրի անվանումը կամ ատրիբուտները, կարևոր չեն (բացի XHTML -ից) :Տարրերը կարող են լինել ներդրված: Օրինակ, ինչպես հետևյալ կոդը.
<br><textarea rows="17" cols="50">
<!DOCTYPE html>
<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
      <title>HTML Document</title>
   </head>
   <body>
      <p>
         <b>
           Այս տեքստը թավ է, 
            <i>Իսկ սա` նաև ավելի շեղ</i>
         </b>
      </p>
   </body>
</html>
</textarea>
</p>
</p>
         </div>
        <div class="footer">
            <br><br>Copyryght\TUMO\&nbsp;&nbsp;&nbsp; Made in Armenia &nbsp;&nbsp;&nbsp;Made in Tumo
        </div>
    </div>  
    </body>

</html>

